package sa.gov.moe.he.moeportal;

import java.util.HashMap;
import java.util.Map;

/**
 * Created by mazoo_000 on 15/04/2015.
 */
public class preparHashMap {


    Map<String,String>  preparHashMap()
    {

        Map<String,String> map = new HashMap<String,String>();
        map.put("خدمة معادلة الشهادات","607");
        //new

        map.put("خدمة طلب منحة داخلية","752");
       map.put("طلب منحة داخلية","609");
        map.put("خدمة طلب منحة خارجية","751");
        map.put("خدمة طلب منح خادم الحرميين الشرفيين للطلبه السوريين","753");
        map.put("خدمات شؤون التصاديق والجامعات","747");

        map.put("خدمة طلب أستاذ زائر","749");
        map.put("خدمة طلب حضور مؤتمر","750");

//end of now serv

        map.put("البريد الإلكتروني","610");
        map.put("خدمة إدارة الندوات والمؤتمرات","613");

        map.put("التعليم العالي الأهلية","614");
     //not in the servicess**        map.put("التعليم الأهلي الجامعي","http://he.moe.gov.sa/ar/studyinside/Private-higher-Education/Pages/default.aspx");
        map.put("لائحة المعادلات","620");
        map.put("خدمة الشؤون الدراسية","621");
        map.put("خدمة الإستفسار للطلبة المبتعثين","622");
        map.put("خدمة إحصاءات التعليم العالي","623");
      //  **        map.put("معارض الكتاب","http://www.mohe.gov.sa/ar/Ministry/International/Department-of-Public-exhibitions/Pages/List-Of-Exhibits2014.aspx");
        map.put("البوابة الداخلية","627");
        map.put("خدمة مؤهل","630");
        map.put("خدمة مقبول","631");
        map.put("بطاقة موظف","636");
        map.put("خدمة المنح الدراسية الحكومية لغير السعوديين في الجامعات الحكومية","645");
        //**        map.put("خدمة مستشارون","https://vi.mohe.gov.sa");
        map.put("خدمة المعارض","647");
        //**        map.put("خدمة معارض الكتاب","http://exp.mohe.gov.sa");
       map.put("خدمة مشروع","648");
        map.put("خدمة متابعة الجامعات الاهلية","649");
        map.put("خدمة استعلام عن حالة قرار معادلة","650");
        map.put("خدمات سفير المالي والإداري","651");
        map.put("خدمات سفير الوثائق","652");
        map.put("خدمات بكالوريوس طب الدول العربية","659");
        map.put("إرسال فعالية علمية","664");
        map.put("إرسال توصية","665");
        map.put("خدمة انتقال طالب من دولة","674");
        map.put("خدمة الانتقال إلى دولة للدارسين على حسابهم الخاص","675");
        map.put("خدمة إفادة بالتخرج","676");
        //fsfsfs
        map.put("خدمة تعديل بيانات الطالب الشخصية","677");
        map.put("خدمة تغيير التخصص","679");
        map.put("خدمة اضافة تقرير دراسي","680");
        map.put("خدمة ترقية بعثة للموظفين المبتعثين من جهات حكومية","681");
        map.put("خدمة تعديل تقرير دراسي","682");
        map.put("خدمة تغيير جامعة أو كلية","683");
        map.put("خدمة تغيير معهد اللغة","684");
        map.put("خدمة حضور مؤتمر أو ندوة","685");
        map.put("خدمة الموافقة للدراسة في الخارج على الحساب الخاص","686");
        map.put("خدمة طلب دورات تدريبية","687");
        map.put("خدمة طلب رحلة علمية","688");
        map.put("خدمة فتح ملف لمرافق دارس","689");
        map.put("خدمة مصادقة الشهادات","690");
        map.put("خدمة إضافة مؤهل دراسي لملف الدارس في الخارج","691");
        map.put("خدمة إضافة بيانات جواز السفر للطلاب","692");
        map.put("خدمة تعديل بيانات الحساب البنكي للطالب","693");
        map.put("خدمة تحديث بيانات الاتصال للطالب","694");
        map.put("تصحيح بيانات الطالب","695");
        map.put("خدمة فتح ملف طالب","696");
        map.put("خدمة طلب تذكرة سفر","697");
        map.put("خدمة إعادة صرف للطالب","698");
        map.put("خدمة تسديد رسوم","699");
        map.put("خدمة طلب تعويض مالي للطالب","700");
        map.put("خدمة صرف فروقات","701");
        map.put("خدمة ضمان مالي","702");
        map.put("خدمة إضافة بيانات التأمين الطبي للطلاب","703");
        map.put("خدمة تمديد الصرف","704");
        map.put("خدمة كشف حساب","705");
        map.put("خدمة مكافأة التميز للطالب","706");
        map.put("خدمة استمرار في دراسة اللغة","707");
        map.put("خدمة العودة من التأجيل","708");
        map.put("خدمة إعادة لعضوية البعثة","709");
        map.put("خدمة إنهاء البعثة","710");
        map.put("خدمة تأجيل البعثة","711");
        map.put("خدمة تعديل تاريخ بداية البعثة","712");
        map.put("خدمة تعديل تاريخ نهاية البعثة","713");
        map.put("خدمة إلحاق مرافق بعضوية البعثة","714");
        map.put("خدمة إلحاق أقارب موفدين بعضوية البعثة","715");
        map.put("خدمة إلحاق بالبعثة","716");
        map.put("خدمة تمديد بعثة","717");
        map.put("خدمة إصدار تعريف للطالب","718");
        map.put("خدمة استمرار بعثة مرافق أو محرم","719");
        map.put("خدمة تغيير محرم الطالبة","720");
        map.put("خدمة اضافة مرافق للطالب","721");
        map.put("خدمة فصل بعثة مرافق /محرم","722");
        map.put("خدمة إعادة النظر","723");
        map.put("خدمة استفسار","724");
        map.put("خدمة طلبات عامة للطالب الدارس بالخارج","725");
        map.put("خدمة الموافقة على عرض السيرة الذاتية للخريجين من خارج المملكة","726");
        map.put("خدمة طلب إجازة","727");
        map.put("خدمة إعادة السنة الدراسية","728");
        map.put("خدمة الإفادة عن طالب","729");
        map.put("خدمة ضمان مالي مؤقت","731");
        map.put("خدمة الحاق مرافق دارس بعضوية البعثة","732");
        map.put("خدمة تجديد التأشيرة","733");
        map.put("خدمة تعديل بيانات مرافق","734");
        map.put("تواصل","745");
       map.put("خدمة تعديل بيانات الطالب الشخصية","677");

        return map;
    }
}
